calculator-ua-client/src/site/soap-response.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
	<S:Header>
		<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
			S:mustUnderstand="1" wsu:Id="_5003">http://calculatorua.wssecurity.ocewsd.abhijitsarkar.certification.edu/CalculatorWS/addResponse
		</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing"
			wsu:Id="_5002">uuid:996aeb7d-9906-4886-8792-9e30b7fbdea7</MessageID>
		<RelatesTo xmlns="http://www.w3.org/2005/08/addressing"
			wsu:Id="_5004">uuid:174b59da-c601-4262-b861-82215bb147fb</RelatesTo>
		<To xmlns="http://www.w3.org/2005/08/addressing" wsu:Id="_5005">http://www.w3.org/2005/08/addressing/anonymous
		</To>
		<wsse:Security S:mustUnderstand="1">
			<wsu:Timestamp
				xmlns:ns18="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns17="http://www.w3.org/2003/05/soap-envelope" wsu:Id="_3">
				<wsu:Created>2012-04-20T19:56:04Z</wsu:Created>
				<wsu:Expires>2012-04-20T20:01:04Z</wsu:Expires>
			</wsu:Timestamp>
			<xenc:ReferenceList
				xmlns:ns18="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns17="http://www.w3.org/2003/05/soap-envelope">
				<xenc:DataReference URI="#_5007" />
			</xenc:ReferenceList>
			<ds:Signature
				xmlns:ns18="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns17="http://www.w3.org/2003/05/soap-envelope" Id="_1">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<exc14n:InclusiveNamespaces PrefixList="wsse S" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" />
					<ds:Reference URI="#_5002">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces
									PrefixList="S" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>TIrnWC16ndq0GIOBier9eAblC8Y=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_5003">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces
									PrefixList="S" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>3f0iAh7bBCvFM62DOXMXQSHA6ZQ=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_5004">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces
									PrefixList="S" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>WFYevkflBQby27UcCXKGEridmoA=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_5005">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces
									PrefixList="S" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>Nd/8wVmBdLowQKMblBRYK+6xcjA=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_5006">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces
									PrefixList="S" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>ozAdbOIGB+WUTJH7Ywi5ZaqOn4I=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_3">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces
									PrefixList="wsu wsse S" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>L3YOstK3aVd66n9r3j7e8HWvqm4=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>wAKj0RR6SRLAIHNd9nY7beo0gCY=</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference>
						<wsse:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKeySHA1"
							EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">k9jUszhGPJvJsuWoDdCXj8bKKOM=</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</S:Header>
	<S:Body wsu:Id="_5006">
		<xenc:EncryptedData
			xmlns:ns18="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
			xmlns:ns17="http://www.w3.org/2003/05/soap-envelope" Id="_5007"
			Type="http://www.w3.org/2001/04/xmlenc#Content">
			<xenc:EncryptionMethod
				Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc" />
			<ds:KeyInfo xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				xsi:type="KeyInfoType">
				<wsse:SecurityTokenReference>
					<wsse:KeyIdentifier
						ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKeySHA1"
						EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">k9jUszhGPJvJsuWoDdCXj8bKKOM=</wsse:KeyIdentifier>
				</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>ASYHq0Hp+hGgCNvHdNMJodSyqiExN4Zz1YXp6iX1dDBTRHLGbANZXBcvF5B8kPZ+Yp61vOB17nkWtKnaWiUkFD/E69s9knrtmjmBt1yeNYJFd7w0L7UEMwHyXsqE7xrTr7tp0TDuvSsWikiCY8cNvRDDOS1I5bg6ms4iA5WYo4ciBV3/4u39JHCkg1mIx+zgh0FSoDFIRV4=
				</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>
	</S:Body>
</S:Envelope>